
Функция TelegramHookPOST(Запрос)
	МассивПараметров = Новый Массив;
	МассивПараметров.Добавить(Запрос.ПолучитьТелоКакСтроку());
	
	ФоновыеЗадания.Выполнить("тм_ChatBot.ОбработатьЗапросПользователя", МассивПараметров);

	Ответ = Новый HTTPСервисОтвет(200);
	Возврат Ответ;
КонецФункции

Функция TelegramHookGET(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	Возврат Ответ;
КонецФункции


Функция AuthWaiterPOST(Запрос)
	token = "";
	Для Каждого ЗаголовокЗапроса Из Запрос.Заголовки Цикл
		Если (НРЕГ(ЗаголовокЗапроса.Ключ) = "token") Тогда
			token = ЗаголовокЗапроса.Значение;
		КонецЕсли;
	КонецЦикла;
	
	Если token = "" Тогда
		СтруктураЗапроса = тм_РаботаСJSON.ДесериализоватьИзJSON(Запрос.ПолучитьТелоКакСтроку());
		ОдноразовыйКод = тм_ChatBot.ОдноразовыйКодАвторизации(СтруктураЗапроса);
		СтруктураОтвета = Новый Структура("code, url", ОдноразовыйКод, "https://t.me/botname");
		Ответ = Новый HTTPСервисОтвет(200);
		Ответ.УстановитьТелоИзСтроки(тм_РаботаСJSON.СериализоватьВJSON(СтруктураОтвета));
		Возврат Ответ;
	КонецЕсли;
	Ответ = Новый HTTPСервисОтвет(403);
	Возврат Ответ;
КонецФункции


Функция TelegramSendToUserPOST(Запрос)
	token = "";
	Для Каждого ЗаголовокЗапроса Из Запрос.Заголовки Цикл
		Если (НРЕГ(ЗаголовокЗапроса.Ключ) = "token") Тогда
			token = ЗаголовокЗапроса.Значение;
		КонецЕсли;
	КонецЦикла;
	
	Если token = "" Тогда
		МассивПараметров = Новый Массив;
		МассивПараметров.Добавить(Запрос.ПолучитьТелоКакСтроку());
		
		ФоновыеЗадания.Выполнить("тм_ChatBot.ОбработатьЗапросОтправкиПользователю", МассивПараметров);
		
		Ответ = Новый HTTPСервисОтвет(200);
		Возврат Ответ;
		
	КонецЕсли;
	Ответ = Новый HTTPСервисОтвет(403);
	Возврат Ответ;
	
КонецФункции

