
// Функция - Тип дня
// 
// Возвращаемое значение:
//   -Строка - Тип дня: "0" - обычный рабочий день, "1" - День выходной или не рабочий, "2" - Предпраздничный
//
Функция ТипДня() Экспорт
	Соединение = Новый HTTPСоединение(
        "isdayoff.ru", // сервер (хост)
        80, // порт, по умолчанию для http используется 80, для https 443
        , // пользователь для доступа к серверу (если он есть)
        , // пароль для доступа к серверу (если он есть)
        , // здесь указывается прокси, если он есть
        , // таймаут в секундах, 0 или пусто - не устанавливать
          // защищенное соединение, если используется https
    );
 
    // Получаем текст корневой страницы через GET-запрос.
    Запрос = Новый HTTPЗапрос("/today");
    // Если бы нужна была другая страница, мы бы указали,
    // например, "/about" или "/news".
 
    Результат = Соединение.Получить(Запрос);
    ДанныеВозврата = "0";
    Если Результат.КодСостояния = 200 Тогда
        ДанныеВозврата = Результат.ПолучитьТелоКакСтроку(); 
	КонецЕсли;
	
	Возврат ДанныеВозврата;
	
КонецФункции
